VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re120/openfoam_setup/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.037855 -0.016000 -0.006000)
    (-0.013855 -0.016000 -0.006000)
    (0.013855 -0.016000 -0.006000)
    (0.109855 -0.016000 -0.006000)
    (-0.037855 0.016000 -0.006000)
    (-0.013855 0.016000 -0.006000)
    (0.013855 0.016000 -0.006000)
    (0.109855 0.016000 -0.006000)

    (-0.037855 -0.016000 0.006000)
    (-0.013855 -0.016000 0.006000)
    (0.013855 -0.016000 0.006000)
    (0.109855 -0.016000 0.006000)
    (-0.037855 0.016000 0.006000)
    (-0.013855 0.016000 0.006000)
    (0.013855 0.016000 0.006000)
    (0.109855 0.016000 0.006000)
);

blocks
(
    hex (0 1 5 4 8 9 13 12)   (12 16 6) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13)  (14 16 6) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (48 16 6) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }

    top
    {
        type wall;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
        );
    }

    back
    {
        type symmetryPlane;
        faces
        (
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
);

mergePatchPairs ();
