VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re120/openfoam_setup/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType  laminar;
