VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re120/openfoam_setup/constant/g
FoamFile
{
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 -9.81 0);
