VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re120/openfoam_setup/Allrun
#!/usr/bin/env bash
export ZSH_NAME="${ZSH_NAME-}"
source /opt/openfoam13/etc/bashrc
set -euo pipefail
cd "$(dirname "$0")"
mkdir -p logs
blockMesh | tee logs/log.blockMesh
snappyHexMesh -overwrite | tee logs/log.snappyHexMesh
checkMesh -allTopology -allGeometry | tee logs/log.checkMesh
postProcess -func writeCellCentres -time 0 | tee logs/log.writeCellCentres
decomposePar -force | tee logs/log.decomposePar
mpirun --use-hwthread-cpus -np 6 foamRun -solver fluid -parallel | tee logs/log.foamRun
